# DuplicateFabricSheet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..DuplicateFabricSheet Property
BuiltInFailures..::..OverlapFailures Class See Also
---
There are identical Fabric sheets in the same place. This will result in double counting in schedules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateFabricSheet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateFabricSheet As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateFabricSheet {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace